In [3]:
# Q1. List any five functions of the pandas library with execution.
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 22, 28],
        'City': ['Delhi', 'Mumbai', 'Pune', 'Hyderabad']}
df = pd.DataFrame(data)
#1) 
df.head()

      Name  Age       City
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   22       Pune
3    David   28  Hyderabad

In [4]:
#2)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [5]:
#3)
df.describe()

         Age
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

In [6]:
#4)
grouped = df.groupby('City')['Age'].mean()
grouped

City
Delhi        25.0
Hyderabad    28.0
Mumbai       30.0
Pune         22.0
Name: Age, dtype: float64

In [7]:
# 5)
sorted_df = df.sort_values(by='Age', ascending=False)
sorted_df

      Name  Age       City
1      Bob   30     Mumbai
3    David   28  Hyderabad
0    Alice   25      Delhi
2  Charlie   22       Pune

In [8]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#DataFrame with a new index that starts from 1 and increments by 2 for each row.
data = {'A': ['Alice', 'Bob', 'Charlie', 'David'],
        'B': [25, 30, 22, 28],
        'C': ['Delhi', 'Mumbai', 'Pune', 'Hyderabad']}
df=pd.DataFrame(data)
new_index = range(1, len(df) * 2 + 1, 2)

df.reset_index(drop=True, inplace=True)
df.index = new_index
df

         A   B          C
1    Alice  25      Delhi
3      Bob  30     Mumbai
5  Charlie  22       Pune
7    David  28  Hyderabad

In [20]:
#Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
# function should print the sum to the console.
data = {'A': ['Alice', 'Bob', 'Charlie', 'David'],
        'Values': [25, 30, 22, 28],
        'C': ['Delhi', 'Mumbai', 'Pune', 'Hyderabad']}
df=pd.DataFrame(data)
first_three=df['Values'].head(3)
first_three

0    25
1    30
2    22
Name: Values, dtype: int64

In [21]:
first_three.sum()

77

In [25]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# 'Word_Count' that contains the number of words in each row of the 'Text' column.
data={'Text':["PW Skills Lab is a magic land where you charge your wand full of the craziest ideas and witness successful projects coming to life."]}
df=pd.DataFrame(data)      
df['word_count'] = df['Text'].apply(lambda x :len(x.split()))
df

                                                Text  word_count
0  PW Skills Lab is a magic land where you charge...          24

# Q5. How are DataFrame.size() and DataFrame.shape() different?
# ANS The DataFrame.size attribute returns the total number of elements in the DataFrame, which is calculated by multiplying the number of rows by the number of columns.
# It gives you the total count of cells in the DataFrame
# The DataFrame.shape attribute returns a tuple representing the dimensions of the DataFrame, in the form (rows, columns).
# It provides the number of rows and the number of columns in the DataFrame.

# Q6. Which function of pandas do we use to read an excel file?
# ANS  pd.read_excel('file.xlsx') Function is used to read an excel file

In [33]:
#Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.
data = {'Email': ['alice@gmail.com', 'bob@gmail.com', 'charlie@gmail.com','john.doe@gmail.com'] }
df=pd.DataFrame(data)
df['Username']=df['Email'].str.split('@').str[0]
df

                Email  Username
0     alice@gmail.com     alice
1       bob@gmail.com       bob
2   charlie@gmail.com   charlie
3  john.doe@gmail.com  john.doe

In [9]:
#Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#function should return a new DataFrame that contains only the selected rows.
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}

df = pd.DataFrame(data)
final_result= select_rows(df)
final_result

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [10]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
# median, and standard deviation of the values in the 'Values' column.
data={'Values': [25, 30, 22, 28] }
df=pd.DataFrame(data)
df['Values'].mean()

26.25

In [48]:
df['Values'].std()

3.5

In [49]:
df['Values'].median()

26.5

In [16]:
#Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#should include the current day.
import pandas as pd
data = {'Date': ['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04', '2023-08-05', '2023-08-06', '2023-08-07'],
        'Sales': [100, 150, 200, 250, 300, 250, 200]}
df = pd.DataFrame(data)

def calculate_moving_average(df, window_size=7):
    df['MovingAverage'] = df['Sales'].rolling(window=window_size, min_periods=1).mean()
    
df['Date'] = pd.to_datetime(df['Date'])

df = df.sort_values(by='Date')

calculate_moving_average(df)
df

        Date  Sales  MovingAverage
0 2023-08-01    100     100.000000
1 2023-08-02    150     125.000000
2 2023-08-03    200     150.000000
3 2023-08-04    250     175.000000
4 2023-08-05    300     200.000000
5 2023-08-06    250     208.333333
6 2023-08-07    200     207.142857

In [17]:
#Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.

def weekday(df):
    df['Weekday'] = df['Date'].dt.strftime('%A')

data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)

df['Date'] = pd.to_datetime(df['Date'])

weekday(df)
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [18]:
#Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

def date_range(df, start_date, end_date):
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df[mask]
    return selected_rows

data = {'Date': ['2023-01-10', '2023-01-15', '2023-02-05', '2023-01-25', '2023-03-10']}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])


start_date = '2023-01-01'
end_date = '2023-01-31'
result = date_range(df, start_date, end_date)
result

        Date
0 2023-01-10
1 2023-01-15
3 2023-01-25